# Using Python for preparing HEAT data

Using Python can allow us to manipulate data in ways that Excel often can't, or in ways that are much easier than their Excel counterparts. Here I am just going to show a few examples of situations that I have encoutnered in the past when dealing with registers, and how I would solve these problems using Python.

The first example is the situation where you are given one name columns with first and last names included, as well as some students having middle names included. Here you can see the sample file I have read in.

In [1]:
import pandas as pd
file = pd.read_csv('multiplenames.csv')
df = pd.DataFrame(file)
df.head()

                         names
0                charlie jones
1                oliwia maslak
2            first middle last
3  python is better than excel

The correct formatting for HEAT is to present this data in two columns: first name and last name. In Excel, we would achieve this by highlighting all of our names column, going into the Data tab and choosing Text to Columns. Selecting 'space' as our delimiter, this willl then create one column per word (or one column for every character between each space, to be more precise). So, if we have a student with middle names, this will create more columns than we want, and we are then left having to find our furthest column, sorting Z-A to have all our results come up, putting these into the second column, and repeating for any other number of middle names. Instead, Python makes this much easier using the following commands:

In [2]:
df['first_name'] = df.names.apply(lambda row: row.split()[0].title())
df['last_name'] = df.names.apply(lambda row: row.split()[-1].title())
df.head()

                         names first_name last_name
0                charlie jones    Charlie     Jones
1                oliwia maslak     Oliwia    Maslak
2            first middle last      First      Last
3  python is better than excel     Python     Excel

Using just two lines of text, we have filtered through the entire dataset and created accurate first and last name columns. These commands will work regardless of how many middle names are present, as can be see here where there are entries with no, one, and multiple middle names. Though this dataset is only small for demonstration purposes, this same syntax will apply regardless of how many entries we have, making it a very efficient way to clean our data. Next, we will drop the 'names' column so we are ready to import the data to HEAT.

In [3]:
df.drop(columns='names', inplace=True)
df.head()

  first_name last_name
0    Charlie     Jones
1     Oliwia    Maslak
2      First      Last
3     Python     Excel

In this example, we are faced with a file which has names in the format of: "Last, First Middle".

In [4]:
last_first = pd.read_csv('last, first name(s).csv')
df1 = pd.DataFrame(last_first)
df1.head()

                                               names
0                                     jones, charlie
1                                  last, first names
2                 smith, alan middle middle2 middle3
3                                       there, hello
4  example, ridiculous I am just going to type a ...

In Excel, this format is particularly annoying to work with because even if we did the method as in the previous example, we would have to switch our columns round, and even then, our last names would all be in the format "Last,", as opposed to "Last" which is the format we want. We would then have to create a new column, and enter into it a formula which removes the last character of every string (which probably exists, though I am not aware of one). Then we would have to copy and paste these as values into our last name column. Python once again makes this process *so* much easier by using the following commands:

In [5]:
df1['first_name'] = df1.names.apply(lambda row: row.split()[1].title())
df1['last_name'] = df1.names.apply(lambda row: row.split()[0][:-1].title())
df1.head()

                                               names  first_name last_name
0                                     jones, charlie     Charlie     Jones
1                                  last, first names       First      Last
2                 smith, alan middle middle2 middle3        Alan     Smith
3                                       there, hello       Hello     There
4  example, ridiculous I am just going to type a ...  Ridiculous   Example

Once again, Python cleans up the data immaculately despite differing lengths of middle names, with no problems at all. I have even added the .title() method to format our data as titles, e.g. Charlie Jones instead of charlie jones. I am almost certain there is no way to do this in Excel. Again, this will work regardless of the number of entries and does not require us to select our data like in Excel; Python knows that it is to apply the command to each entry in the dataframe. As before, we will drop the 'names' column to format our data better so that it is ready to import to HEAT.

In [6]:
df1.drop(columns='names', inplace=True)
df1.head()

   first_name last_name
0     Charlie     Jones
1       First      Last
2        Alan     Smith
3       Hello     There
4  Ridiculous   Example

In this example, we are looking at activity titles instead. Often when we upload titles to HEAT, we want them to include the date to make it easier to find and sort uploads.

In [7]:
title_date = pd.read_csv('title_date.csv')
df2 = pd.DataFrame(title_date)
df2.head()

     activity_title        date
0          activity  23/03/2023
1               CED  18/05/2023
2  building futures  11/05/2023
3           unifrog  31/12/2022
4           example  01/01/1900

Excel doesn't perform terribly in this respect, and actually this is perfectly doable in Excel for the most part. With that being said, it is still easier in Python in my opinion, using just one simple sum to create our new title for every entry in our dataframe.

In [8]:
df2['title_new'] = df2.apply(lambda row: row.activity_title + ' ' + row.date, axis=1)
df2.head()

     activity_title        date                    title_new
0          activity  23/03/2023          activity 23/03/2023
1               CED  18/05/2023               CED 18/05/2023
2  building futures  11/05/2023  building futures 11/05/2023
3           unifrog  31/12/2022           unifrog 31/12/2022
4           example  01/01/1900           example 01/01/1900

Here, however, we can see another benefit of using Python over Excel. Suppose we only want our dataframe to contain certain columns: using Excel, we would have to go through each column and delete the ones we don't want. When you have sheets with as many columns as those in the HEAT import templates, that can be a huge pain. Python makes it so much easier for us, because we can simply tell it which columns we want to keep and it will create a dataframe containing only those columns. I have then renamed the column just to neaten up our output slightly.

In [9]:
df2 = df2.title_new
title = pd.DataFrame(df2)
title.rename(columns={'title_new': 'Title'}, inplace=True)
title.head()

                         Title
0          activity 23/03/2023
1               CED 18/05/2023
2  building futures 11/05/2023
3           unifrog 31/12/2022
4           example 01/01/1900

# Closing remarks

I hope you have learned something new and potentially valuable about the potential for using Python in the workplace to streamline our operations. There are *so* many benefits to using Python that I could get into, but these are simply some practical benefits that I have encountered in my experience thus far. Thanks :)